wegam/STM32F1xWorkSpace/Driver/Components/SCR/LCD.c
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void LCD_Show(
							u16 x,			//x				:起点x坐标
							u16 y,			//y				:起点y坐标
							u8 font,		//font		:字体大小
							u8 num,			//num			:字节数
							u8 *Buffer	//Buffer	:显示的内容缓存
)		//高通字库测试程序
{
	unsigned short	MaxV,MaxH;	//边界值
	unsigned char i=0;
	unsigned char CodeBuffer[130]={0};
	switch(LCDSYS->Flag.Rotate)
	{
		case Draw_Rotate_90D:
			MaxV	=	LCDSYS->Data.MaxH;
			MaxH	=	LCDSYS->Data.MaxV;
			break;
		case Draw_Rotate_180D:
			MaxV	=	LCDSYS->Data.MaxV;
			MaxH	=	LCDSYS->Data.MaxH;
			break;
		case Draw_Rotate_270D:
			MaxV	=	LCDSYS->Data.MaxH;
			MaxH	=	LCDSYS->Data.MaxV;
			break;
		default:
			MaxV	=	LCDSYS->Data.MaxV;
			MaxH	=	LCDSYS->Data.MaxH;
			break;
	}
	for(i=0;i<num;i++)
	{
		unsigned char GetBufferLength	=	0;
		unsigned char dst=Buffer[i];
		//A=====================双字节--汉字
		if(dst>0x80)
		{
			u16 word=dst<<8;
      
			dst=Buffer[i+1];
			word=word|dst;			
			//A1=====================显示超限换行
      if(x>MaxH-font)
      {
        x=0;
        y+=font;
      }
      //A2=====================显示到屏尾，从原点开始
      if(y>MaxV-font)
      {
        y=x=0;
      }
      //A3=====================读取点阵数据
			GetBufferLength	=	GT32L32_ReadCode(font,word,CodeBuffer);		//从字库中读数据并返回数据长度
			//A4=====================写入屏幕
			LCD_ShowWord(x,y,font,GetBufferLength,CodeBuffer,0);
			//A5=====================水平显示地址增加
      x+=font;
			i++;		//双字节，减两次
			
		}
		//B=====================单字节--ASCII字符集
		else
		{			
			//B1=====================显示超限换行
      if(x>MaxH-font/2)
      {
        x=0;
        y+=12;
      }
      //B2=====================显示到屏尾，从原点开始
      if(y>MaxV-font)
      {
        y=x=0;
      }
      //B3=====================读取点阵数据
			GetBufferLength	=	GT32L32_ReadCode(font,(u16)dst,CodeBuffer);		//从字库中读数据并返回数据长度
			//B4=====================写入屏幕
			LCD_ShowChar(x,y,font,GetBufferLength,CodeBuffer,0);
			//B5=====================水平显示地址增加
      x+=font/2;						
		}
	}
}
/*******************************************************************************
* 函数名			:	LCD_ShowHex
* 功能描述		:	十六进制显示 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void LCD_ShowHex(
							u16 x,			//x				:起点x坐标
							u16 y,			//y				:起点y坐标
							u8 font,		//font		:字体大小
							u8 num,			//num			:数据个数
              u8 bitnum,  //num			:位数
							u8 *Buffer	//Buffer	:显示的内容缓存
)		//高通字库测试程序
{
	unsigned short	MaxV,MaxH;	//边界值
	unsigned char i=0;
  unsigned char Cril  = 0;
	unsigned char CodeBuffer[130]={0};
  char	DataBuffer[256]={0};			//记录format内码
  
  
	switch(LCDSYS->Flag.Rotate)
	{
		case Draw_Rotate_90D:
			MaxV	=	LCDSYS->Data.MaxH;
			MaxH	=	LCDSYS->Data.MaxV;
			break;
		case Draw_Rotate_180D:
			MaxV	=	LCDSYS->Data.MaxV;
			MaxH	=	LCDSYS->Data.MaxH;
			break;
		case Draw_Rotate_270D:
			MaxV	=	LCDSYS->Data.MaxH;
			MaxH	=	LCDSYS->Data.MaxV;
			break;
		default:
			MaxV	=	LCDSYS->Data.MaxV;
			MaxH	=	LCDSYS->Data.MaxH;
			break;
	}
	for(i=0;i<num;i++)
	{
    unsigned char GetBufferLength	=	0;
    for(Cril=bitnum/4;Cril>0;Cril--)
    {
      //=============================8位显示方式      
      unsigned char dst=(((u32)Buffer[i]>>(Cril-1)*4)&0x0F);
      //1=====================转换为ASSIC码
      if((0<=dst)&&(9>=dst))
      {
        dst+=0x30;
      }
      else if((10<=dst)&&(15>=dst))
      {
        dst+=0x37;
      }
      //1=====================显示超限换行
      if(x>MaxH-font/2)
      {
        x=0;
        y+=font;
      }
      //2=====================显示到屏尾，从原点开始
      if(y>MaxV-font)
      {
        y=x=0;
      }
      //3=====================读取点阵数据
      GetBufferLength	=	GT32L32_ReadCode(font,dst,CodeBuffer);		//从字库中读数据并返回数据长度
      //4=====================写入屏幕
      LCD_ShowChar(x,y,font,GetBufferLength,CodeBuffer,0);
      //5=====================显示地址增加
      x+=font/2;
    }
    //========================插入空格
    //3=====================读取点阵数据
    GetBufferLength	=	GT32L32_ReadCode(font,' ',CodeBuffer);		//从字库中读数据并返回数据长度
    //4=====================写入屏幕
    LCD_ShowChar(x,y,font,GetBufferLength,CodeBuffer,0);
    //5=====================显示地址增加
    x+=font/2;
	}
}
/*******************************************************************************
*函数名		:	LCD_ShowString
*功能描述	:	显示字符串高通字库
*输入			: x,y:起点坐标
						*p:字符串起始地址
						用16字体
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
unsigned int LCD_Printf(u16 x,u16 y,u8 font,u16 color,const char *format,...)				//后边的省略号就是可变参数
{ 
		
//		va_list ap; 										//VA_LIST 是在C语言中解决变参问题的一组宏，所在头文件：#include <stdarg.h>,用于获取不确定个数的参数
//		static char string[ 256 ];			//定义数组，
//  	va_start( ap, format );
//		vsprintf( string , format, ap );    
//		va_end( ap );
	
	unsigned short	MaxV,MaxH;	//边界值
	unsigned short	i=0;				//显示
	char	DataBuffer[256]={0};			//记录format内码
  unsigned char CodeBuffer[130]={0};
	//1)**********获取数据宽度
	u16 InputDataSize=strlen((const char*)format);		//获取数据宽度	
	
	//3)**********args为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
	va_list args; 
	//5)**********初始化args的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
	va_start(args, format);
	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
	vsnprintf(DataBuffer, InputDataSize+1,format, args);

	//7)**********结束可变参数的获取
	va_end(args);                                      		
  if((12!=font)&&(16!=font)&&(24!=font)&&(32!=font))
  {
    font  = 24;
  }
	LCD_Show(x,y,font,InputDataSize,(unsigned char*)DataBuffer);
	return InputDataSize;
}
/**************************************************************************************************
* [Function] LCD_DrawPixelEx:  函数功能、注意事项等的描述
* [param01]u16 x: description
* [param02]u16 y: description
* [param03]u16 color: description
**************************************************************************************************/
void LCD_DrawPixelEx( u16 x, u16 y, u16 color )
{
	LCD_DrawDot(x,y,color);		//画点
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void LCD_Delay(u32 xms)
{
	while(xms--);
}

//#endif//LCD_61509_EN
/************************************** The End Of FILE **************************************/


